### Pandas
* Dataframe - Special Object to data in tabular form

In [2]:
import pandas as pd #importing pandas
import numpy as np  # importing pandas

In [11]:
np.random.randint(1,100,5)  #random data of 5 students using randint func

array([78, 51, 37,  1, 74])

In [13]:
# Lets create a data frame
user_data = {
    "MarksA" : np.random.randint(1,100,5),
    "MarksB" : np.random.randint(50,100,5),
    "MarksC" : np.random.randint(1,100,5),
}

In [14]:
user_data

{'MarksA': array([36, 27, 67, 86, 86]),
 'MarksB': array([50, 64, 97, 76, 83]),
 'MarksC': array([14, 48, 47, 69, 77])}

In [19]:
df = pd.DataFrame(user_data,dtype="float32")  #creating an data frame from user_data, dtype is used to change the datatype
print(df)

   MarksA  MarksB  MarksC
0    36.0    50.0    14.0
1    27.0    64.0    48.0
2    67.0    97.0    47.0
3    86.0    76.0    69.0
4    86.0    83.0    77.0

In [20]:
df.head(3)   #display data for first 3 rows

   MarksA  MarksB  MarksC
0    36.0    50.0    14.0
1    27.0    64.0    48.0
2    67.0    97.0    47.0

In [18]:
df.columns  #prints column names

Index(['MarksA', 'MarksB', 'MarksC'], dtype='object')

In [21]:
df.to_csv('marks.csv')  #creates an marks csv file in your local directory

In [44]:
#To import the csv file
my_data = pd.read_csv('marks.csv')
my_data

   Unnamed: 0  MarksA  MarksB  MarksC
0           0    36.0    50.0    14.0
1           1    27.0    64.0    48.0
2           2    67.0    97.0    47.0
3           3    86.0    76.0    69.0
4           4    86.0    83.0    77.0

In [45]:
my_data = my_data.drop(columns=['Unnamed: 0'])  #drops Unnamed column
my_data

   MarksA  MarksB  MarksC
0    36.0    50.0    14.0
1    27.0    64.0    48.0
2    67.0    97.0    47.0
3    86.0    76.0    69.0
4    86.0    83.0    77.0

### Pandas Basic- 2

In [46]:
my_data.describe()  #prints the statical data

          MarksA     MarksB    MarksC
count   5.000000   5.000000   5.00000
mean   60.400000  74.000000  51.00000
std    27.682124  17.958285  24.46426
min    27.000000  50.000000  14.00000
25%    36.000000  64.000000  47.00000
50%    67.000000  76.000000  48.00000
75%    86.000000  83.000000  69.00000
max    86.000000  97.000000  77.00000

In [47]:
my_data.tail(3)  #displays last 3 rows of the table

   MarksA  MarksB  MarksC
2    67.0    97.0    47.0
3    86.0    76.0    69.0
4    86.0    83.0    77.0

In [48]:
df.iloc[3]  #displays 4th row (*note index starts from 0)

MarksA    86.0
MarksB    76.0
MarksC    69.0
Name: 3, dtype: float32

In [50]:
df.iloc[3,1] #displays 4th rows 2nd column (*note index starts from 0)

76.0

In [53]:
idx = [df.columns.get_loc("MarksB"),df.columns.get_loc("MarksC")]  #prints the location of the MarksB,MarksC column
print(idx)
df.iloc[3,idx]

[1, 2]

MarksB    76.0
MarksC    69.0
Name: 3, dtype: float32

In [54]:
my_data

   MarksA  MarksB  MarksC
0    36.0    50.0    14.0
1    27.0    64.0    48.0
2    67.0    97.0    47.0
3    86.0    76.0    69.0
4    86.0    83.0    77.0

In [63]:
#sorting the values using sort_values func
my_data.sort_values(by=["MarksA"],ascending = False)  #Sorting data in descending order for 'MarksA' column

   MarksA  MarksB  MarksC
3    86.0    76.0    69.0
4    86.0    83.0    77.0
2    67.0    97.0    47.0
0    36.0    50.0    14.0
1    27.0    64.0    48.0

In [67]:
data_array = my_data.values  #coverting the table into numpy array
print(type(data_array))
print(data_array.shape)

<class 'numpy.ndarray'>
(5, 3)

In [68]:
data_array

array([[36., 50., 14.],
       [27., 64., 48.],
       [67., 97., 47.],
       [86., 76., 69.],
       [86., 83., 77.]])

In [69]:
#Numpy array back into dataframe
new_df = pd.DataFrame(data_array,dtype='int32',columns=["Physics","Chemistry","Maths"])
new_df

   Physics  Chemistry  Maths
0       36         50     14
1       27         64     48
2       67         97     47
3       86         76     69
4       86         83     77

In [70]:
new_df.to_csv("PCM.csv",index=False)